# В программе были использованы f-строки, документацию по ссылке к ним прочитал.
import random # Комманда для подключения модуля random, для 13 строки в моём коде. Запомнить!

# То же самое, что и в 38 строке.
try:
    num1 = int(input("Введите начальное число: "))
    num2 = int(input("Введите конечное число: "))
except ValueError:
    print("Ошибка! Вы ввели недопустимое значение")
    exit() # Запомнить.

# Проверка на дурака.
if (num1 >= num2):
    print("Ошибка! Начальное число не должно быть больше или равно конечному.")
    exit() # Комманда для завершения программы при несоблюдении условия. Запомнить!

# Рандомное загаданное число, запомнить операцию random.randint(min_value, max_value)!
hidden_num = random.randint(num1, num2)

# То же самое использовал.
try:
    attempts = int(input("Введите количество попыток: ")) # Задаем количество попыток.
except ValueError:
    print("Ошибка! Вы ввели недопустимое значение")
    exit() # Запомнить.

# Проверка на дурака.
if (attempts <= 0):
    print("Ошибка!Количество попыток должно быть положительным.")
    exit() # Запомнить!

print(f"Я загадал число от {num1} до {num2}. У тебя {attempts} попытки(ок)!")

attempts_left = attempts # Создаем новую переменную для подсчёта оставшихся попыток, это нужно для того, чтобы переменная attempts оставалась неизменной.
attempt_number = 1 # Счётчик номеров попыток для вывода пользователя.

while (attempts_left > 0):

# Использовал try-except, так как знаю принцип работы try-catch в C++.
    try:
        guess = int(input("Введите число: "))
    except ValueError:
        print("Ошибка! Введите число, а не буквы")
        continue

    # Проверка на дурака.
    if (guess < num1 or guess > num2):
        print("Ошибка! Вы вышли за пределы допустимых значений") 
        continue

    print(f"Попытка {attempt_number}. Введённое число: {guess}")

    if (guess == hidden_num): # В Python нужно ставить табуляцию обязательно после начала while и перед if, иначе if компилятор будет игнорировать.
        print("Ты угадал. Молодец!")
        exit() # То же самое. Запомнить!

    elif (guess > hidden_num):
        if (attempts_left > 1):
            print("Большое число, попробуй ввести число поменьше")

    else:
        if (attempts_left > 1):
            print("Маленькое число, попробуй ввести число побольше")

    attempts_left -= 1 # После совершения попыток, количество оставшихся попыток уменьшается.
    attempt_number += 1 # Тем временем, количество совершенных попыток увеличивается.

# Обозначить пользователю сколько у него осталось попыток.
    if (attempts_left > 0):
        print(f"Осталось попыток: {attempts_left}")

# Проверка если попытки закончились, не дать пользователю играть снова.
if (attempts_left == 0):
    print(f"Не угадал! Было загадано число: {hidden_num}")
    exit() # Запомнить!