# Использовал f-строки, прочитал документацию по ссылке.
# Использовал try-except, так как знаком с try-catch.
try:
    length = int(input("Введите длину прямоугольника: ")) # Преобразовал в int, чтобы вводить можно было только целые числа.
    width = int(input("Введите ширину прямоугольника: ")) # То же самое.
    # Проверка на дурака.
    if (length <= 0 or width <= 0):
        print("Длина и ширина должна быть больше 0")
        exit() # Запомнить! Выход из программы.

except ValueError:
    print("Ошибка! Запрещён ввод букв и символов, только цифры и числа")

mult = length * width 

print (f"Площадь прямоугльника: {mult}")