# В задании использовал f-строки, документацию об их использовании прочитал. 
name = input("Как тебя зовут?    ") # Оставил много пробелов для красоты. 

if not name.isalpha(): # Использовал isalpha() для того, чтобы нельзя было ввести цифры вместо имени.
    print("Ошибка! Имя должно состоять только из букв.")
    exit() # Запомнить(закрыть программу).

print (f"{name}") # Использовал здесь f-строку, а не просто name для однотонной структуры кода. 
print (f"Привет, {name}! Приятно познакомиться")