# В задании использовал f-строки, документацию о них прочитал.
try:
    num1 = float(input("Введите первое число: ")) # Сделал числа float для большего функционала.
    num2 = float(input("Введите второе число: ")) # Тут тоже самое.
except ValueError:
    print("Ошибка! Можно вводить только числа с плавающей запятой, ввод символов запрещён.")
    
operator = input("Выберите оператор (+, -, /, *, %): ")

if operator == '+':
    result = num1 + num2

elif operator == '-':
    result = num1 - num2

elif operator == '/':
    result = num1 / num2

elif operator == '*':
    result = num1 * num2

# Добавил оператор % для большего функционала.
elif operator == '%':
    result = num1 % num2

    # Хотел еще добавить ! сюда, но понял, что факториал считается для 1 числа, а у меня ввод для 2 чисел.
else:
    print("Ошибка, вы ввели не оператор или такой оператор не предусмотрен.")

print(f"Результат: {result}")